# Дан набор точек на координатной плоскости. Необходимо подсчитать и вывести количество точек, лежащих в каждой координатной четверти.

k = int(input())
ch1 = 0
ch2 = 0
ch3 = 0
ch4 = 0
for i in range(1, k+1):
    n = input().split()
    if int(n[0]) > 0 and int(n[1]) > 0:
        ch1 += 1
    if int(n[0]) < 0 and int(n[1]) > 0:
        ch2 += 1
    if int(n[0]) < 0 and int(n[1]) < 0:
        ch3 += 1
    if int(n[0]) > 0 and int(n[1]) < 0:
        ch4 += 1
print(f"Первая четверть: {ch1}", f"Вторая четверть: {ch2}", f"Третья четверть: {ch3}", f"Четвертая четверть: {ch4}", sep="\n")

#######################################################

# Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы (нижний левый угол).

n = int(input())
s = [list(map(int, input().split())) for _ in range(n)]
mx = -1000
for i in range(n):
    for j in range(n):
        if i >= j:
            mx = max(mx, s[i][j])
print(mx)

#######################################################





